nobmaste/QH_Learning_Resources/Module/DDS/AD9854/测试程序/STM32版本/STM32F103/STM32_AD9854测试程序_V2.1/User/AD9854.c
}

////====================================================================================
////函数名称:void Freq_doublt_convert(double Freq)
////函数功能:正弦信号频率数据转换
////入口参数:Freq   需要转换的频率，取值从0~SYSCLK/2
////出口参数:无   但是影响全局变量FreqWord[6]的值
////说明：   有公式FTW = (Desired Output Frequency × 2N)/SYSCLK得到该函数，
////         其中N=48，Desired Output Frequency 为所需要的频率，即Freq，SYSCLK
////         为可编程的系统时钟，FTW为48Bit的频率控制字，即FreqWord[6]
////注意：   该函数与上面函数的区别为该函数的入口参数为double，可使信号的频率更精确
////         谷雨建议在100HZ以下用本函数，在高于100HZ的情况下用函数void Freq_convert(long Freq)
////====================================================================================
//void Freq_double_convert(double Freq)   
//{
//	u32 Low32;
//	u32 High16;
//  double Temp=Freq_mult_doulle;   	            //23ca99为2的48次方除以120M
//	Freq*=(double)(Temp);
////	1 0000 0000 0000 0000 0000 0000 0000 0000 = 4294967295
//	High16 = (int)(Freq/4294967295);                  //2^32 = 4294967295
//	Freq -= (double)High16*4294967295;
//	Low32 = (u32)Freq;

//	FreqWord[0]=Low32;	     
//	FreqWord[1]=Low32>>8;
//	FreqWord[2]=Low32>>16;
//	FreqWord[3]=Low32>>24;
//	FreqWord[4]=High16;
//	FreqWord[5]=High16>>8;			
//} 

////====================================================================================
////函数名称:void AD9854_SetSine_double(double Freq,uint Shape)
////函数功能:AD9854正弦波产生程序
////入口参数:Freq   频率设置，取值范围为0~1/2*SYSCLK
////         Shape  幅度设置. 为12 Bit,取值范围为(0~4095) 
////出口参数:无
////====================================================================================
//void AD9854_SetSine_double(double Freq,u16 Shape)
//{
//	u8 count=0;
//	u8 Adress;

//	Adress=0x04;						     //选择频率控制字1地址的初值

//	Freq_double_convert(Freq);		           //频率转换
//	 
//	for(count=6;count>0;)	                    //写入6字节的频率控制字  
//  {
//		AD9854_WR_Byte(Adress++,FreqWord[--count]);
//  }
//	
//	AD9854_WR_Byte(0x21,Shape>>8);	  //设置I通道幅度
//	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
//	
//	AD9854_WR_Byte(0x23,Shape>>8);	  //设置Q通道幅度
//	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

//	AD9854_UDCLK_Set;                    //更新AD9854输出
//  AD9854_UDCLK_Clr;
//}

//====================================================================================
//函数名称:void AD9854_InitFSK(void)
//函数功能:AD9854的FSK初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitFSK(void)
{

	AD9854_WR_Byte(0x1d,0x10);	     	// 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	   	// 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x02);	     	// 设置系统为模式1，由外部更新
	AD9854_WR_Byte(0x20,0x60);	    	// 设置为可调节幅度，取消插值补偿


}

//====================================================================================
//函数名称:void AD9854_SetFSK(ulong Freq1,ulong Freq2)
//函数功能:AD9854的FSK设置
//入口参数:Freq1   FSK频率1   
//         Freq2   FSK频率2
//出口参数:无
//====================================================================================
void AD9854_SetFSK(u32 Freq1,u32 Freq2)
{
  u8 count=6;
	u8 Adress1,Adress2;

	const u16 Shape=4000;						// 幅度设置. 为12 Bit,取值范围为(0~4095)
	
	Adress1=0x04;				 // 选择频率控制字1地址的初值
	Adress2=0x0a;				 // 选择频率控制字2地址的初值
	
	Freq_convert(Freq1);           	// 频率转换1
	
	for(count=6;count>0;)	          // 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress1++,FreqWord[--count]);
  }
	
	Freq_convert(Freq2);						// 频率转换2

	for(count=6;count>0;)	          // 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress2++,FreqWord[--count]);
  }

	AD9854_WR_Byte(0x21,Shape>>8);	     // 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	     // 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

	AD9854_UDCLK_Set;                    // 更新AD9854输出
  AD9854_UDCLK_Clr;		
}

//====================================================================================
//函数名称:void AD9854_InitBPSK(void)
//函数功能:AD9854的BPSK初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitBPSK(void)
{
	
	AD9854_WR_Byte(0x1d,0x10);				// 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	   	// 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x08);	      // 设置系统为模式4，由外部更新
	AD9854_WR_Byte(0x20,0x60);	      // 设置为可调节幅度，取消插值补偿


}

//====================================================================================
//函数名称:void AD9854_SetBPSK(uint Phase1,uint Phase2)
//函数功能:AD9854的BPSK设置
//入口参数:Phase1   调制相位1
//         Phase2	调制相位2
//出口参数:无
//说明：   相位为14Bit，取值从0~16383，谷雨建议在用本函数的时候将Phase1设置为0，
//         将Phase1设置为8192，180°相位
//====================================================================================
void AD9854_SetBPSK(u16 Phase1,u16 Phase2)
{
	u8 count;

	const u32 Freq=60000;
  const u16 Shape=4000;

	u8 Adress;
	Adress=0x04;                           		// 选择频率控制字1地址的初值

	AD9854_WR_Byte(0x00,Phase1>>8);	       		// 设置相位1
	AD9854_WR_Byte(0x01,(u8)(Phase1&0xff));
	
	AD9854_WR_Byte(0x02,Phase2>>8);	          // 设置相位2
	AD9854_WR_Byte(0x03,(u8)(Phase2&0xff));

	Freq_convert(Freq);                     	// 频率转换

	for(count=6;count>0;)	                 		// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress++,FreqWord[--count]);
  }

	AD9854_WR_Byte(0x21,Shape>>8);	        	// 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	        	// 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

	AD9854_UDCLK_Set;                      		// 更新AD9854输出
  AD9854_UDCLK_Clr;	
}

//====================================================================================
//函数名称:void AD9854_InitOSK(void)
//函数功能:AD9854的OSK初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitOSK(void)
{																				

  AD9854_WR_Byte(0x1d,0x10);	       			// 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	   				// 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x00);	      			// 设置系统为模式0，由外部更新
	AD9854_WR_Byte(0x20,0x70);	      			// 设置为可调节幅度，取消插值补偿,通断整形内部控制


}

//====================================================================================
//函数名称:void AD9854_SetOSK(uchar RateShape)
//函数功能:AD9854的OSK设置
//入口参数: RateShape    OSK斜率,取值为4~255，小于4则无效
//出口参数:无
//====================================================================================
void AD9854_SetOSK(u8 RateShape)
{
	u8 count;

	const u32 Freq=60000;				// 设置载频
  const u16  Shape=4000;			// 幅度设置. 为12 Bit,取值范围为(0~4095)

	u8 Adress;
	Adress=0x04;            		// 选择频率控制字地址的初值

