nobmaste/QH_Learning_Resources/Module/DDS/AD9854/测试程序/STM32版本/STM32F103/STM32_AD9854测试程序_V2.1/User/AD9854.c
	Freq_convert(Freq);                       		// 频率转换

	for(count=6;count>0;)	                    		// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress++,FreqWord[--count]);
  }

	AD9854_WR_Byte(0x21,Shape>>8);	            	// 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	            	// 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));  	 


  AD9854_WR_Byte(0x25,RateShape);				    		// 设置OSK斜率

	AD9854_UDCLK_Set;                         		// 更新AD9854输出
  AD9854_UDCLK_Clr;	
}

//====================================================================================
//函数名称:void AD9854_InitAM(void)
//函数功能:AD9854的AM初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitAM(void)
{
	
	
	AD9854_WR_Byte(0x1d,0x10);	          			// 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	             	// 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x01);	              	// 设置系统为模式0，由外部更新
	AD9854_WR_Byte(0x20,0x60);	             		// 设置为可调节幅度，取消插值补偿


}

//====================================================================================
//函数名称:void AD9854_SetAM(uchar Shape)
//函数功能:AD9854的AM设置
//入口参数:Shape   12Bit幅度,取值从0~4095   
//出口参数:无
//====================================================================================
void AD9854_SetAM(u32 Freq,u16 Shape)
{
	u8 count;

//	 u32 Freq=60000;			 //设置载频

	u8  Adress;
	Adress=0x04;      				// 选择频率控制字地址的初值
	
		Freq_convert(Freq);                       		// 频率转换

	for(count=6;count>0;)	                      		// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress++,FreqWord[--count]);
  }
	
	AD9854_WR_Byte(0x21,Shape>>8);	             		// 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	              	// 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

	AD9854_UDCLK_Set;                              	// 更新AD9854输出
  AD9854_UDCLK_Clr;			
}
//====================================================================================
//函数名称:void am_test (uint32_t fund_fre, uint8_t modulation)
//函数功能:AD9854的AM波形的调制频率和调制度的设置
//入口参数:fund_fre   调制频率 （0~100）
//				 modulation 调制度   （0~100）
//出口参数:无
//====================================================================================
void am_test (uint32_t fund_fre, uint8_t modulation)
{
	modu_buf = modulation;
	fund_fre_buf = fund_fre;	
	step_up = (float)fund_fre_buf * 65535 / 10000;
}


//====================================================================================
//函数名称:void AD9854_InitRFSK(void)
//函数功能:AD9854的RFSK初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitRFSK(void)
{


	AD9854_WR_Byte(0x1d,0x10);	        // 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	      // 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x24);	        // 设置系统为模式2，由外部更新,使能三角波扫频功能
	AD9854_WR_Byte(0x20,0x60);	        // 设置为可调节幅度，取消插值补偿,关闭Sinc效应	

}

//====================================================================================
//函数名称:void AD9854_SetRFSK(u32 Freq_Low,u32 Freq_High,u32 Freq_Up_Down,u32 FreRate)
//函数功能:AD9854的RFSK设置
//入口参数:Freq_Low          RFSK低频率	   48Bit
//         Freq_High         RFSK高频率	   48Bit
//         Freq_Up_Down		 步进频率	   48Bit
//		     FreRate           斜率时钟控制  20Bit
//出口参数:无
//注：     每两个脉冲之间的时间周期用下式表示（FreRate +1）*（System Clock ），一个脉冲,
//         频率 上升或者下降 一个步进频率
//====================================================================================
void AD9854_SetRFSK(u32 Freq_Low,u32 Freq_High,u32 Freq_Up_Down,u32 FreRate)
{
	u8 count=6;
	u8 Adress1,Adress2,Adress3;
  const u16  Shape=3600;			  // 幅度设置. 为12 Bit,取值范围为(0~4095)

	Adress1=0x04;		     					// 选择频率控制字地址的初值 
	Adress2=0x0a;
	Adress3=0x10;

	Freq_convert(Freq_Low);                   		// 频率1转换

	for(count=6;count>0;)	                    		// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress1++,FreqWord[--count]);
  }

	Freq_convert(Freq_High);               				// 频率2转换

	for(count=6;count>0;)	                     		// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress2++,FreqWord[--count]);
  }

	Freq_convert(Freq_Up_Down);          					// 步进频率转换

	for(count=6;count>0;)	                				// 写入6字节的频率控制字  
  {
		AD9854_WR_Byte(Adress3++,FreqWord[--count]);
  }

	AD9854_WR_Byte(0x1a,(u8)((FreRate>>16)&0x0f));// 设置斜升速率
	AD9854_WR_Byte(0x1b,(u8)(FreRate>>8));
	AD9854_WR_Byte(0x1c,(u8)FreRate);				    

	AD9854_WR_Byte(0x21,Shape>>8);	        			// 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	         			// 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

	AD9854_UDCLK_Set;                           	// 更新AD9854输出
  AD9854_UDCLK_Clr;	
}
//====================================================================================
//函数名称:void  AD9854_InitChirp(void)
//函数功能:AD9854的Chirp初始化
//入口参数:无
//出口参数:无
//====================================================================================
void AD9854_InitChirp(void)
{	
	AD9854_WR_Byte(0x1d,0x10);	  			// 关闭比较器
	AD9854_WR_Byte(0x1e,CLK_Set);	   		// 设置系统时钟倍频
	AD9854_WR_Byte(0x1f,0x26);	        // 设置系统为模式2，由外部更新,使能三角波扫频功能
	AD9854_WR_Byte(0x20,0x60);	        // 设置为可调节幅度，取消插值补偿	
}

//====================================================================================
//函数名称:void AD9854_SetChirp(unsigned long Freq_Low,unsigned long Freq_Up_Down,unsigned long FreRate)
//函数功能:AD9854的Chirp设置
//入口参数:Freq_Low          RFSK低频率	   48Bit
//         Freq_Up_Down		 步进频率	   48Bit
//		   FreRate           斜率时钟控制  20Bit
//出口参数:无
//注：     每两个脉冲之间的时间周期用下式表示（FreRate +1）*（System Clock ），一个脉冲,
//         频率 上升或者下降 一个步进频率
//====================================================================================
void AD9854_SetChirp(unsigned long Freq_Low,unsigned long Freq_Up_Down,unsigned long FreRate)
{
	u8 count=6;
	u8 Adress1,/*Adress2,*/Adress3;
  const u16  Shape=4000;			   // 幅度设置. 为12 Bit,取值范围为(0~4095)

	Adress1=0x04;		               // 选择频率控制字地址的初值 

	Adress3=0x10;

	Freq_convert(Freq_Low);                      		// 频率1转换

	for(count=6;count>0;)	                         	// 写入6字节的频率控制字  
	{
		AD9854_WR_Byte(Adress1++,FreqWord[--count]);
	}

	Freq_convert(Freq_Up_Down);            					// 步进频率转换

	for(count=6;count>0;)	                      		// 写入6字节的频率控制字  
	{
		AD9854_WR_Byte(Adress3++,FreqWord[--count]);
	}

	AD9854_WR_Byte(0x1a,(u8)((FreRate>>16)&0x0f));	// 设置斜升速率
	AD9854_WR_Byte(0x1b,(u8)(FreRate>>8));
	AD9854_WR_Byte(0x1c,(u8)FreRate);				    

	AD9854_WR_Byte(0x21,Shape>>8);	               	// 设置I通道幅度
	AD9854_WR_Byte(0x22,(u8)(Shape&0xff));
	
	AD9854_WR_Byte(0x23,Shape>>8);	              	// 设置Q通道幅度
	AD9854_WR_Byte(0x24,(u8)(Shape&0xff));

	AD9854_UDCLK_Set;                            		// 更新AD9854输出
  AD9854_UDCLK_Clr;
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
